sifao/m01/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication cartesianMesh
runApplication checkMesh
runApplication setFields
#runApplication $(getApplication)
runApplication decomposePar
runParallel $(getApplication)

#------------------------------------------------------------------------------
